In [5]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import random
import time
import itertools
import math

%matplotlib inline

## Load Training Data

In [7]:
train_data = pd.read_csv('data/train.csv')
pd.set_option('display.max_rows', 20)
display(train_data)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...,...
881,882,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

## Do a Simple Analysis on the Training Data

In [8]:
analysis = pd.DataFrame(columns=['col_name','null_num','type_num'])
for col in train_data:
    row = pd.Series({'col_name':col, 
                     'null_num':train_data[col].isnull().sum(), 
                     'type_num':train_data[col].unique().size})
    analysis = analysis.append(row, ignore_index=True)
    
display(analysis)

       col_name null_num type_num
0   PassengerId        0      891
1      Survived        0        2
2        Pclass        0        3
3          Name        0      891
4           Sex        0        2
5           Age      177       89
6         SibSp        0        7
7         Parch        0        7
8        Ticket        0      681
9          Fare        0      248
10        Cabin      687      148
11     Embarked        2        4

## Select and Convert Training Data

In [55]:
y_train = train_data['Survived']

'''
 drop 'Name', 'Ticket', 'Cabin'(too many missing), 'Embarked'(not related)
'''

x_train = train_data[['Pclass', 'SibSp', 'Parch']]


# Convert Sex feature from category into data 
x_train.insert(1, 'Sex', (train_data['Sex'].map({'female':0, 'male':1}).astype(int)))


# replace missing age value with median age
median_age = train_data['Age'].median()
print("Age Median:", median_age)
x_train.insert(2, 'Age',  train_data['Age'].fillna(median_age))


# replace missing fare value with median fare
median_fare = train_data['Fare'].median()
print("Fare Median:", median_fare)
x_train.insert(5, 'Fare',  train_data['Fare'].fillna(median_fare))

    
display(x_train)

Age Median: 28.0
Fare Median: 14.4542

     Pclass  Sex   Age  SibSp  Parch     Fare
0         3    1  22.0      1      0   7.2500
1         1    0  38.0      1      0  71.2833
2         3    0  26.0      0      0   7.9250
3         1    0  35.0      1      0  53.1000
4         3    1  35.0      0      0   8.0500
5         3    1  28.0      0      0   8.4583
6         1    1  54.0      0      0  51.8625
7         3    1   2.0      3      1  21.0750
8         3    0  27.0      0      2  11.1333
9         2    0  14.0      1      0  30.0708
..      ...  ...   ...    ...    ...      ...
881       3    1  33.0      0      0   7.8958
882       3    0  22.0      0      0  10.5167
883       2    1  28.0      0      0  10.5000
884       3    1  25.0      0      0   7.0500
885       3    0  39.0      0      5  29.1250
886       2    1  27.0      0      0  13.0000
887       1    0  19.0      0      0  30.0000
888       3    0  28.0      1      2  23.4500
889       1    1  26.0      0      0  30.0000
890       3    1  32.0      0      0   7.7500

[891 rows x 6 columns]

## 3-Fold Cross Validation

In [62]:
from sklearn.model_selection import KFold

indices_3Fold = KFold(n_splits=3, shuffle=True, random_state=int(time.time())).split(train_data)
for train, test in indices_3Fold:
    print("%d %d" % (len(train), len(test)))
    print(test)

594 297
[  0   1   6   7   9  12  13  16  18  21  22  28  29  31  36  42  48  52
  60  66  68  76  87  89  91  94 100 108 110 116 117 128 129 130 131 132
 133 136 138 139 140 146 147 151 154 159 161 162 169 176 178 180 183 188
 190 193 195 198 200 201 205 206 207 209 214 217 219 223 224 226 228 233
 236 238 240 242 247 249 252 253 257 260 262 265 266 267 268 269 271 277
 279 280 281 282 285 289 290 292 296 298 302 303 306 307 311 315 319 322
 326 327 332 339 346 350 356 357 360 361 364 368 373 377 378 381 382 386
 389 390 404 405 407 418 419 425 433 438 441 450 451 452 455 457 458 460
 464 465 466 469 472 475 476 477 479 480 482 490 492 495 498 501 505 506
 508 509 511 519 524 525 527 539 540 541 543 544 545 549 556 558 562 563
 565 566 569 572 574 579 583 585 587 591 592 593 595 596 604 605 609 614
 624 633 636 638 641 645 646 648 650 652 656 663 664 665 667 669 672 673
 676 677 678 680 686 688 690 698 700 701 704 705 712 714 717 718 721 728
 729 732 734 735 736 737 738 740 743 744 748 749 750 752 756 760 761 767
 768 770 771 782 785 787 788 789 790 793 795 796 797 799 801 802 817 818
 822 823 824 825 828 836 838 841 847 849 852 853 854 855 862 868 871 873
 874 879 880 881 883 884 885 886 890]
594 297
[  2   3  11  15  19  20  25  27  32  33  41  43  44  45  49  55  56  58
  61  62  64  72  73  74  75  77  80  81  85  86  88  90  92  93  95  96
  98  99 101 102 105 106 107 109 111 118 121 122 123 143 144 148 149 150
 156 160 165 168 170 171 175 177 179 181 182 184 185 186 187 189 191 194
 199 202 204 208 211 212 213 215 218 222 229 232 235 241 243 244 245 251
 256 258 270 274 275 283 287 288 293 299 300 308 309 310 312 313 317 321
 324 328 330 331 333 337 341 343 344 348 349 352 355 359 362 363 366 367
 369 370 371 372 375 376 380 384 388 393 394 395 398 399 400 401 402 403
 408 411 414 415 416 420 421 423 424 427 428 431 434 442 447 456 461 463
 467 468 471 473 484 486 488 489 493 494 496 499 500 502 503 512 514 517
 521 532 533 535 536 537 546 548 552 555 557 561 567 568 570 576 577 581
 582 584 588 589 598 601 602 606 607 610 611 615 616 617 619 620 621 623
 625 626 628 630 631 632 634 635 637 642 649 651 654 658 660 661 668 670
 681 682 683 685 694 695 696 697 707 709 711 713 715 716 720 722 724 727
 730 731 742 746 757 758 759 763 764 765 774 777 779 784 786 792 798 800
 805 808 811 814 815 819 820 827 830 833 834 835 839 844 845 848 850 856
 857 858 860 861 867 869 876 888 889]
594 297
[  4   5   8  10  14  17  23  24  26  30  34  35  37  38  39  40  46  47
  50  51  53  54  57  59  63  65  67  69  70  71  78  79  82  83  84  97
 103 104 112 113 114 115 119 120 124 125 126 127 134 135 137 141 142 145
 152 153 155 157 158 163 164 166 167 172 173 174 192 196 197 203 210 216
 220 221 225 227 230 231 234 237 239 246 248 250 254 255 259 261 263 264
 272 273 276 278 284 286 291 294 295 297 301 304 305 314 316 318 320 323
 325 329 334 335 336 338 340 342 345 347 351 353 354 358 365 374 379 383
 385 387 391 392 396 397 406 409 410 412 413 417 422 426 429 430 432 435
 436 437 439 440 443 444 445 446 448 449 453 454 459 462 470 474 478 481
 483 485 487 491 497 504 507 510 513 515 516 518 520 522 523 526 528 529
 530 531 534 538 542 547 550 551 553 554 559 560 564 571 573 575 578 580
 586 590 594 597 599 600 603 608 612 613 618 622 627 629 639 640 643 644
 647 653 655 657 659 662 666 671 674 675 679 684 687 689 691 692 693 699
 702 703 706 708 710 719 723 725 726 733 739 741 745 747 751 753 754 755
 762 766 769 772 773 775 776 778 780 781 783 791 794 803 804 806 807 809
 810 812 813 816 821 826 829 831 832 837 840 842 843 846 851 859 863 864
 865 866 870 872 875 877 878 882 887]